БухЭксп/DataProcessors/CW_ПФ_АктДоходыКорректировочный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>CW_ПФ_АктДоходыКорректировочный</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеПараметры</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СоответствиеАктовИсходящимСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СоответствиеАктовИсходящимСчетам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Акт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчетаЗадолженности</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственнаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/DataProcessors/CW_ПФ_АктДоходыКорректировочный/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.0.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВидПечатнаяФорма();
	
	СтруктураОписания.Наименование 				= "Акт корректировочный";
	СтруктураОписания.Описание 					= "Акт корректировочный";
	СтруктураОписания.Версия					= "3.2.9.2";
	СтруктураОписания.МинимальнаяВерсияМодуля   = "8.3.17.2";
	СтруктураОписания.ИсторияИзменений			= Истина;
	
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "Регистрация");
	
	//Макросы  шаблона представления
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерДокумента]", 			"Номер документа", 				"ПолучитьНомерДокумента(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерИсправления]", 			"Номер исправлния", 			"ПолучитьНомерИсправления(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yyyy]", "Дата документа (dd.MM.yyyy)", 	"ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yy]", 	"Дата документа (dd.MM.yy)",	"ПолучитьДатуДокументаГГ(ПараметрыПроцедуры)");	
	//Макросы  шаблона представления

	Возврат СтруктураОписания;
	
КонецФункции

Функция ПолучитьМакетИсторииИзменений() Экспорт 
	
	Возврат ПолучитьМакет("ИсторияИзменений");
	
КонецФункции

//Функции макросов шаблона представления
Функция ПолучитьНомерДокумента(ПараметрыПроцедуры) Экспорт
	
	Возврат СокрЛП(ПараметрыПроцедуры.НомерДокумента);
	
КонецФункции

Функция ПолучитьНомерИсправления(ПараметрыПроцедуры) Экспорт
	
	НомерИсправления  = ?(ЗначениеЗаполнено(ПараметрыПроцедуры.НомерИсправления), " (испр. "+Формат(ПараметрыПроцедуры.НомерИсправления,"ЧГ=0")+")","");
	Возврат СокрЛП(НомерИсправления);
	
КонецФункции

Функция ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yyyy");
	
КонецФункции

Функция ПолучитьДатуДокументаГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yy");
	
КонецФункции
//Функции макросов шаблона представления

Функция Регистрация(Ссылка) Экспорт 
	
	МассивМетаданных = Новый Массив;
	МассивМетаданных.Добавить("Документ.CW_ДоходыПоГрузоперевозке");
	
	Возврат _ПО.ОбновитьРегистрациюПечатнойФормы(Ссылка,"Акт корректировочный",МассивМетаданных);
	
КонецФункции

Функция Использование(ПодключаемыйОбъект=Неопределено) Экспорт 
	
	Возврат СсылкаНаОбъект.ФормируетсяАкт 
			И СсылкаНаОбъект.Корректировка 
			И НЕ СсылкаНаОбъект.ЭтоУниверсальныйДокумент;
	
КонецФункции

Функция ИспользованиеВКонтексте(КонтекстВызова) Экспорт 
	
	Возврат	ТипЗнч(КонтекстВызова) = Тип("ДокументСсылка.CW_ОтчетЭкспедитора")
				И СсылкаНаОбъект.ФормируетсяСчетФактура 
				И СсылкаНаОбъект.Корректировка
				И НЕ СсылкаНаОбъект.ЭтоУниверсальныйДокумент;

КонецФункции


Функция ПечатнаяФорма(НастройкиПечати=Неопределено) Экспорт
	
	Если (НастройкиПечати=Неопределено) Тогда
		
		НастройкиПечати = Новый Структура;
		
	КонецЕсли; 
	
	ДляРассылки = Ложь; 
	НастройкиПечати.Свойство("ДляРассылки",ДляРассылки);
	
	ПодписьИПечать = Ложь; 
	НастройкиПечати.Свойство("ПодписьИПечать",ПодписьИПечать);
	
	Ссылка = СсылкаНаОбъект;
	
	// --- 
	
	СтруктураПФ = _сф.ст_Создать("Представление,Параметры,ПечатнаяФорма");
	
	// ---------------------------------------------------------------------------- 
	// формируем представление
	
	НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Ссылка, "НомерАкта", "ДатаАкта");
	ДатаДокумента = Ссылка.ДатаАкта;
	
	Если Ссылка.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение")Тогда
		ПредставлениеДокумента     = "Корректировочный акт №"            + НомерДокумента + " от " + Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
		ПредставлениеДокументаАнгл = "Correction acceptance act №" + НомерДокумента + " of  "+ Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
		НадписьАКТ				   = "Корректировочный акт"
	Иначе
		ПредставлениеДокумента     = "Исправительный акт №"            + НомерДокумента + " от " + Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
		ПредставлениеДокументаАнгл = "Correction acceptance act №" + НомерДокумента + " of  "+ Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
		НадписьАКТ				   = "Исправительный акт"
	КонецЕсли;
	
	//Установка представления печатной формы
	ПараметрыПодключаемогоОбъекта = Новый Структура;
	ПараметрыПодключаемогоОбъекта.Вставить("ПодключаемыйОбъект",	НастройкиПечати.ПодключаемыйОбъект);
	ПараметрыПодключаемогоОбъекта.Вставить("ШаблонПредставления",	НастройкиПечати.ШаблонПредставления);
	ПараметрыПодключаемогоОбъекта.Вставить("Представление",			СокрЛП(ПредставлениеДокумента));
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("НомерДокумента",	НомерДокумента);
	ПараметрыПроцедуры.Вставить("ДатаДокумента",	ДатаДокумента);
	ПараметрыПроцедуры.Вставить("НомерИсправления",	СсылкаНаОбъект.НомерИсправления);
	
	СтруктураПФ.Представление = CW_ПодключаемыеКомандыСервер.ПолучитьПредставлениеПоШаблону(ЭтотОбъект, ПараметрыПодключаемогоОбъекта, ПараметрыПроцедуры);
	//Установка представления печатной формы

	// получаем/корректируем параметры печати (кол-во экземпляров, печать по-умолчанию)
	СтруктураПараметров = _сф.ст_Создать("Количество,Печать");
	
	КоличествоЭксземпляров = CW_Настройки.ПолучитьНастройкуПользователя(, "КоличествоЭкземпляровИсхАкта", Истина);
	Если НЕ КоличествоЭксземпляров = Неопределено Тогда
		Если НЕ КоличествоЭксземпляров = 0 Тогда
			СтруктураПараметров.Количество = КоличествоЭксземпляров;
			СтруктураПараметров.Печать = Истина;
		Иначе
			СтруктураПараметров.Количество = 0;
			СтруктураПараметров.Печать = Ложь;
		КонецЕсли; 
	Иначе	
		СтруктураПараметров.Количество = 2;
		СтруктураПараметров.Печать = Истина;	
	КонецЕсли;	
	
	СтруктураПФ.Параметры = СтруктураПараметров;
	
	// формируем печатную форму
	ТД=Новый ТабличныйДокумент;
	ТД.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	ТД.АвтоМасштаб=Истина;
	
	//	Попытка
	
	Макет = ПолучитьМакет("МакетАкт");
	
	СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметров.Дата 				= ДатаДокумента;
	СтруктураПараметров.Договор 			= Ссылка.Договор;
	СтруктураПараметров.ПриложениеКДоговору = Ссылка.ПриложениеКДоговору;
	
	ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров);
	
	//СведенияООрганзации  = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Ссылка.Организация, Ссылка.ВедомыйДокумент.Дата);
	//ОрганизацияНаименованиеПолное = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияООрганзации, "ПолноеНаименование,");
	//ОрганизацияНаименованиеСокращенное = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияООрганзации, "СокращенноеНаименование,");
	
	НаименованияОрганизации = Справочники.Организации.НаименованияНаДату(Ссылка.Организация, ДатаДокумента);
	КППОрганизации 			= Справочники.Организации.КППНаДату(Ссылка.Организация, ДатаДокумента);
	
	НаименованияКонтрагента = Справочники.Контрагенты.НаименованияНаДату(Ссылка.Контрагент, ДатаДокумента);
	
	// шапка
	// язык печати документов : 0=русский 1=английский 2=двуязычный
	Если ПараметрыДоговора.ЯзыкПечатиДокументов=1 Тогда 
		обл = Макет.ПолучитьОбласть("Шапка_Иностр");
		стр = CW_Настройки.ПараметрУчетнойПолитики(Ссылка.Дата, Ссылка.Организация, "НаименованиеОрганизацииАнгл")+Символы.ПС+ПараметрыДоговора.АдресОрганизацииАнгл;
		обл.Параметры.ТекстШапки = стр;
		ТД.Вывести(обл);
	ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов=2 Тогда 
		обл = Макет.ПолучитьОбласть("Шапка_Иностр");
		стр = НаименованияОрганизации.НаименованиеДляПечатныхФорм+Символы.ПС+ПараметрыДоговора.АдресОрганизации+", тел.: "+ПараметрыДоговора.ТелефонОрганизации
		+ Символы.ПС
		+ CW_Настройки.ПараметрУчетнойПолитики(Ссылка.Дата, Ссылка.Организация, "НаименованиеОрганизацииАнгл")+Символы.ПС+ПараметрыДоговора.АдресОрганизацииАнгл
		;
		обл.Параметры.ТекстШапки = стр;
		ТД.Вывести(обл);
	Иначе 
		//Если (Ссылка.Валюта=CW_Настройки.ВалютаРегламентированногоУчета()) ИЛИ Ссылка.Договор.ВзаиморасчетыВУЕ Тогда 
		
		Если ПараметрыДоговора.ВыводитьРеквизитыПриПечатиАкта Тогда
			
			КППОрганизации = Справочники.Организации.КППНаДату(Ссылка.Организация, Ссылка.Дата);  
			КППОрганизации = ?(ПустаяСтрока(КППОрганизации), "", ", КПП "+КППОрганизации);
	
			обл = Макет.ПолучитьОбласть("Шапка_Рус");
			Исполнитель = НаименованияОрганизации.НаименованиеДляПечатныхФорм + символы.пс +
			"ИНН: "+ Ссылка.Организация.ИНН + КППОрганизации + Символы.ПС +
			"Адрес: " + ПараметрыДоговора.АдресОрганизации + Символы.ПС +
			"Р/С: " + ПараметрыДоговора.РасчетныйСчетОрганизации.НомерСчета + Символы.ПС +
			ПараметрыДоговора.РасчетныйСчетОрганизации.Банк.Наименование + Символы.ПС +
			"К/С: " + ПараметрыДоговора.РасчетныйСчетОрганизации.Банк.КоррСчет + Символы.ПС +
			"БИК: " + ПараметрыДоговора.РасчетныйСчетОрганизации.Банк.Код;
			
			КППКонтрагента = Справочники.Контрагенты.КППНаДату(Ссылка.Контрагент, Ссылка.Дата);
  			КППКонтрагента = ?(ПустаяСтрока(КППКонтрагента), "", ", КПП "+КППКонтрагента);
	
			Заказчик = НаименованияКонтрагента.ПолноеНаименование + символы.пс +
			"ИНН: "+ Ссылка.Контрагент.ИНН + КППКонтрагента + Символы.ПС +
			"Адрес: " + ПараметрыДоговора.Адрес + Символы.ПС +
			"Р/С: " + ПараметрыДоговора.РасчетныйСчет.НомерСчета + Символы.ПС +
			ПараметрыДоговора.РасчетныйСчет.Банк.Наименование + Символы.ПС +
			"К/С: " + ПараметрыДоговора.РасчетныйСчет.Банк.КоррСчет + Символы.ПС +
			"БИК: " + ПараметрыДоговора.РасчетныйСчет.Банк.Код;
			
			обл.Параметры.НадписьИсполнитель = "Исполнитель:";
			обл.Параметры.НадписьЗаказчик    = "Заказчик:";
			обл.Параметры.Исполнитель = Исполнитель;
			обл.Параметры.Заказчик = Заказчик;
			ТД.Вывести(обл);
			
		КонецЕсли;
		//Иначе 
		//	обл = Макет.ПолучитьОбласть("Шапка_Иностр");
		//	стр = Ссылка.Организация.НаименованиеСокращенное+Символы.ПС+ПараметрыДоговора.АдресОрганизации+", тел.: "+ПараметрыДоговора.ТелефонОрганизации;
		//	обл.Параметры.ТекстШапки = стр;
		//	ТД.Вывести(обл);
		//КонецЕсли;
	КонецЕсли;
	
	Подписанты = CW_Печать.ВернутьПодписантов(Ссылка, ПараметрыДоговора);
	
	// верхняя часть
	Приложение     = "Договор №";
	ПриложениеАнгл = "Contract №";			
	Если ЗначениеЗаполнено(Ссылка.ПриложениеКДоговору) Тогда
		Приложение     = Строка(Ссылка.ПриложениеКДоговору.ВидДокумента)+" №"+Строка(Ссылка.ПриложениеКДоговору.НомерДокумента)+" от "+Формат(Ссылка.ПриложениеКДоговору.ДатаДокумента,"ДФ=dd.MM.yyyy")+ " к договору №";
		ПриложениеАнгл = "Annex №"+ Строка(Ссылка.ПриложениеКДоговору.НомерДокумента)+" of "+Формат(СсылкаНаОбъект.ПриложениеКДоговору.ДатаДокумента,"ДФ=dd.MM.yyyy")+" to the сontract №";
	КонецЕсли;	
	
	Если ПараметрыДоговора.ЯзыкПечатиДокументов=1 Тогда 
		обл = Макет.ПолучитьОбласть("ВерхняяЧасть_Иностр_1");
		ТД.Вывести(обл);
		обл = Макет.ПолучитьОбласть("ВерхняяЧасть_Иностр_2");
		обл.Параметры.НомерДатаДокумента = ПредставлениеДокументаАнгл;
		ТД.Вывести(обл);
		Если ПараметрыДоговора.ВыводитьВАктахИнформациюОСчетах Тогда
			обл = Макет.ПолучитьОбласть("ВерхняяЧасть_Иностр_3");
			обл.Параметры.СвязанныеСчета = СписокСвязанныхСчетов(1);
			ТД.Вывести(обл);
		КонецЕсли;								
	ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов=2 Тогда 
		обл = Макет.ПолучитьОбласть("ВерхняяЧасть_Иностр_1");
		ТД.Вывести(обл);
		обл = Макет.ПолучитьОбласть("ВерхняяЧасть_Иностр_2");
		обл.Параметры.НомерДатаДокумента = ПредставлениеДокумента; 
		ТД.Вывести(обл);
		Если ПараметрыДоговора.ВыводитьВАктахИнформациюОСчетах Тогда
			обл = Макет.ПолучитьОбласть("ВерхняяЧасть_Иностр_3");
			обл.Параметры.СвязанныеСчета = СписокСвязанныхСчетов(0);
			ТД.Вывести(обл);
		КонецЕсли;								
		обл = Макет.ПолучитьОбласть("ВерхняяЧасть_Иностр_2");
		обл.Параметры.НомерДатаДокумента = ПредставлениеДокументаАнгл;
		ТД.Вывести(обл);
		Если ПараметрыДоговора.ВыводитьВАктахИнформациюОСчетах Тогда
			обл = Макет.ПолучитьОбласть("ВерхняяЧасть_Иностр_3");
			обл.Параметры.СвязанныеСчета = СписокСвязанныхСчетов(1);
			ТД.Вывести(обл);
		КонецЕсли;								
	Иначе 
		//Если (Ссылка.Валюта=CW_Настройки.ВалютаРегламентированногоУчета()) ИЛИ Ссылка.Договор.ВзаиморасчетыВУЕ Тогда 
		обл = Макет.ПолучитьОбласть("ВерхняяЧасть_Рус");
		обл.Параметры.НадписьАКТ = НадписьАКТ;
		обл.Параметры.НомерРабот = ?(ПараметрыДоговора.Услуги0Или1Работы=0, "оказания услуг", "сдачи-приемки работ")+" № "+НомерДокумента;
		обл.Параметры.НомерДоговора = Приложение + Ссылка.Договор.НомерДоговора + " от " + Формат(Ссылка.Договор.ДатаДоговора,"ДФ=dd.MM.yyyy");
		Если ПараметрыДоговора.ВыводитьВАктахИнформациюОСчетах Тогда
			обл.Параметры.СвязанныеСчета = СписокСвязанныхСчетов(0);
		КонецЕсли;	
		Если ЗначениеЗаполнено(Ссылка.ВедомыйДокумент) Тогда
			обл.Параметры.Дата = Формат(Ссылка.ВедомыйДокумент.Дата, "ДЛФ=DD");
		Иначе
			обл.Параметры.Дата = Формат(Ссылка.Ссылка.ДатаАкта, "ДЛФ=DD");
		КонецЕсли;
		обл.Параметры.Текст = 
		"Мы, нижеподписавшиеся, представитель Исполнителя " + НаименованияОрганизации.НаименованиеДляПечатныхФорм 
		+ " " + СокрЛП(Подписанты.РуководительДолжностьРус) + " " + СокрЛП(Подписанты.РуководительПоДоговору) 
		+ " с одной стороны, и представитель Заказчика " 
		+ СокрЛП(НаименованияКонтрагента.ПолноеНаименование + " " + СокрЛП(ПараметрыДоговора.ДолжностьРуководителя) +" " + СокрЛП(ПараметрыДоговора.Руководитель))
		+ ", составили настоящий акт о том, что Исполнитель "
		+?(ПараметрыДоговора.Услуги0Или1Работы=0, "оказал", "выполнил")
		+", а Заказчик принял следующие "+?(ПараметрыДоговора.Услуги0Или1Работы=0, "услуги", "работы")+":"; 
		ТД.Вывести(обл);
	КонецЕсли;
	
	
	ВывестиНаАнглийском = ПараметрыДоговора.ЯзыкПечатиДокументов=1 или ПараметрыДоговора.ЯзыкПечатиДокументов=2;
	ВывестиНаРрусском 	= ПараметрыДоговора.ЯзыкПечатиДокументов=0 или ПараметрыДоговора.ЯзыкПечатиДокументов=2;
	
	Если ПараметрыДоговора.ЯзыкПечатиДокументов <> 0  Тогда
		обл = Макет.ПолучитьОбласть("ВерхняяЧасть_Иностр_1");
		ТД.Вывести(обл);
	КонецЕсли;
	
	//Дополнение 
	Если ВывестиНаРрусском и ВывестиНаАнглийском Тогда
		обл = Макет.ПолучитьОбласть("Покупатель_Рус");
		обл.Параметры.Покупатель = СокрЛП(НаименованияКонтрагента.ПолноеНаименование); 
		ТД.Вывести(обл);
	КонецЕсли; 
	
	Если ПараметрыДоговора.ВыводитьДополнениевШапкуАкта Тогда
		Если ВывестиНаРрусском Тогда
			обл = Макет.ПолучитьОбласть("Дополнительно_Рус");
			обл.Параметры.Дополнительно = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВШапкеАкта, Ссылка, Неопределено, Ссылка.Услуги);
			ТД.Вывести(обл);
		КонецЕсли;
	КонецЕсли;
	
	Если ВывестиНаРрусском и ВывестиНаАнглийском Тогда
		обл = Макет.ПолучитьОбласть("Пробел");
		ТД.Вывести(обл);
	КонецЕсли;
	
	Если ВывестиНаАнглийском Тогда
		обл = Макет.ПолучитьОбласть("Покупатель_Англ");
		обл.Параметры.Покупатель_Англ = СокрЛП(ПараметрыДоговора.НаименованиеКонтрагентаАнгл); 
		ТД.Вывести(обл);
		
		Если ПараметрыДоговора.ВыводитьДополнениевШапкуАкта Тогда
			обл = Макет.ПолучитьОбласть("Дополнительно_Англ");
			обл.Параметры.Дополнительно_Англ = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВШапкеАктаАнгл, Ссылка, Неопределено, Ссылка.Услуги);
			ТД.Вывести(обл);
		КонецЕсли;
	КонецЕсли;
	//Дополнение

	
	//--------
	//  шапка таблицы, строки таблицы, подвал таблицы
	облСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	облПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	Если ПараметрыДоговора.ЯзыкПечатиДокументов=1 Тогда 
		облШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_Англ");
		облПодвалТаблицы.Параметры.НадписьИТОГОУвеличение = "Total increase (sum of rows C)";
		облПодвалТаблицы.Параметры.НадписьИТОГОУменьшение = "Total decrease (sum of rows D)";
		стрбезНДС = "Without VAT";
	ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов=2 Тогда 
		облШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_Двуяз");
		облПодвалТаблицы.Параметры.НадписьИТОГОУвеличение = "Всего увеличение (сумма строк В) / Total increase (sum of rows C)";
		облПодвалТаблицы.Параметры.НадписьИТОГОУменьшение = "Всего уменьшение (сумма строк Г) / Total decrease (sum of rows D)";
		стрбезНДС = "БЕЗ НДС / Without VAT";
	Иначе 
		облШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_Рус");
		облПодвалТаблицы.Параметры.НадписьИТОГОУвеличение = "Всего увеличение (сумма строк В)";
		облПодвалТаблицы.Параметры.НадписьИТОГОУменьшение = "Всего уменьшение (сумма строк Г)";
		стрбезНДС = "БЕЗ НДС";
	КонецЕсли;
	
	//Валюта = ?(Ссылка.Договор.ВзаиморасчетыВУЕ, CW_Настройки.ВалютаРегламентированногоУчета(), Ссылка.Валюта); 
	Валюта = Ссылка.Валюта; 
	ПредставлениеВалютыРус = CW_Настройки_ПИ.ПредставлениеВалютыНаРусском(Валюта);
	
	облШапкаТаблицы.Параметры.Заполнить(Новый Структура("Валюта",    Валюта));
	облШапкаТаблицы.Параметры.Заполнить(Новый Структура("ВалютаРус", Валюта));
	ТД.Вывести(облШапкаТаблицы);
	
	ОсновнойЯзык = Константы.CW_ОсновнойЯзык.Получить();
	
	ТаблицаУслуг = CW_Финансы.ПолучитьУслугиДокумента(Ссылка);
	ТаблицаУслуг.Колонки.Добавить("ПредставлениеГП");
	
	ТаблицаУслуг.Колонки.Добавить("СуммаУвеличение");
	ТаблицаУслуг.Колонки.Добавить("СуммаУменьшение");
	
	ТаблицаУслуг.Колонки.Добавить("СуммаНДСУвеличение");
	ТаблицаУслуг.Колонки.Добавить("СуммаНДСУменьшение");
	
	ТаблицаУслуг.Колонки.Добавить("ИтогоУвеличение");
	ТаблицаУслуг.Колонки.Добавить("ИтогоУменьшение");
	
	ТаблицаУслуг.ЗаполнитьЗначения(0, "СуммаУвеличение,СуммаУменьшение,СуммаНДСУвеличение,СуммаНДСУменьшение,ИтогоУвеличение,ИтогоУменьшение");
	
	Для Каждого СтрокаУслуг из ТаблицаУслуг Цикл
		СтрокаУслуг.ПредставлениеГП = СокрЛП(СтрокаУслуг.Грузоперевозка.CW_Представление);
		
		СуммаДельта = СтрокаУслуг.Сумма_ДоКорректировки - СтрокаУслуг.Сумма;
		Постфикс 	= ?(СуммаДельта < 0 , "Увеличение","Уменьшение");
		СтрокаУслуг["Сумма"+Постфикс] = Макс(-СуммаДельта, СуммаДельта); 
		
		СуммаНДСДельта = СтрокаУслуг.НДС_ДоКорректировки - СтрокаУслуг.НДС;
		Постфикс 	= ?(СуммаНДСДельта < 0 , "Увеличение","Уменьшение");
		СтрокаУслуг["СуммаНДС"+Постфикс] = Макс(-СуммаНДСДельта, СуммаНДСДельта); 
		
		ИтогоДельта = СтрокаУслуг.Всего_ДоКорректировки - СтрокаУслуг.Всего;
		Постфикс 	= ?(ИтогоДельта < 0 , "Увеличение","Уменьшение");
		СтрокаУслуг["Итого"+Постфикс] = Макс(-ИтогоДельта, ИтогоДельта); 
		
	КонецЦикла;	
	
	ВсегоСтрокДляВывода = ТаблицаУслуг.Количество();
	ТекущаяСтрока = 0;
	
	РасчетыУЕ = Ссылка.Договор.ВзаиморасчетыВУЕ;
	
	// подготовим подвал и подписи
	Подвал = Новый ТабличныйДокумент;
	
	// --- 
	облПодвалТаблицы.Параметры.СуммаУвеличение = ТаблицаУслуг.Итог("СуммаУвеличение");
	облПодвалТаблицы.Параметры.СуммаУменьшение = ТаблицаУслуг.Итог("СуммаУменьшение");
	
	облПодвалТаблицы.Параметры.СуммаНДСУвеличение = ТаблицаУслуг.Итог("СуммаНДСУвеличение");
	облПодвалТаблицы.Параметры.СуммаНДСУменьшение = ТаблицаУслуг.Итог("СуммаНДСУменьшение");
	
	облПодвалТаблицы.Параметры.СуммаИТОГОУвеличение = ТаблицаУслуг.Итог("ИТОГОУвеличение");
	облПодвалТаблицы.Параметры.СуммаИТОГОУменьшение = ТаблицаУслуг.Итог("ИТОГОУменьшение");
	
	ТЗ_НДС = Ссылка.Услуги.Выгрузить();
	ТЗ_НДС.Свернуть("СтавкаНДС");
	
	ОднаСтавкаНДС = ТЗ_НДС.Количество() = 1;
	
	Если облПодвалТаблицы.Параметры.СуммаНДСУвеличение = 0 Тогда
		Если ОднаСтавкаНДС Тогда
			Если ТЗ_НДС[0].СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
				облПодвалТаблицы.Параметры.СуммаНДСУвеличение = "-";
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
	
	Если облПодвалТаблицы.Параметры.СуммаНДСУменьшение = 0 Тогда
		Если ОднаСтавкаНДС Тогда
			Если ТЗ_НДС[0].СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
				облПодвалТаблицы.Параметры.СуммаНДСУменьшение = "-";
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Подвал.Вывести(облПодвалТаблицы);
	// --- 
	// сумма прописью
	обл = Макет.ПолучитьОбласть("НижняяЧасть");
	
	Если ТаблицаУслуг.Итог("НДС") <> 0 Тогда
		
		тСтавкаНДС = " - ";
		Если ОднаСтавкаНДС Тогда
			тСтавкаНДС = Строка(ТЗ_НДС[0].СтавкаНДС) + " - ";
		КонецЕсли;
		
		РазницаНДС 	= ТаблицаУслуг.Итог("НДС") - ТаблицаУслуг.Итог("НДС_ДоКорректировки");
		
		СимволОткрытойСкобки = ?(РазницаНДС<0,"(","");
		СимволЗакрытойСкобки = ?(РазницаНДС<0,")","");
		
		ПредставлНДС = ", в том числе НДС "   + тСтавкаНДС +СимволОткрытойСкобки+ Формат(РазницаНДС, "ЧДЦ=2; ЧН=0,00")				+ СимволЗакрытойСкобки + " " 	+ Валюта;
		ПредставлНДСАнгл = ", including VAT " + тСтавкаНДС +СимволОткрытойСкобки+ Формат(РазницаНДС,"ЧДЦ=2; ЧРД=.; ЧРГ=,; ЧН=0.00")	+ СимволЗакрытойСкобки + " "	+ Валюта;
	Иначе
		Если ПараметрыДоговора.ВыводСуммыБезНДСДляАкта = 1 Тогда
			масНДС = Ссылка.Услуги.НайтиСтроки(Новый Структура("СтавкаНДС", Перечисления.СтавкиНДС.НДС0));
			Если масНДС.Количество() > 0 Тогда
				ПредставлНДС = ", без НДС.";
				ПредставлНДСАнгл = ", without VAT."
			Иначе
				ПредставлНДС = ", НДС не облагается.";
				ПредставлНДСАнгл = ", without VAT."
			КонецЕсли;	
		ИначеЕсли ПараметрыДоговора.ВыводСуммыБезНДСДляАкта = 0 Тогда	
			ПредставлНДС = ", в том числе НДС 0,00 " + Валюта; 
			ПредставлНДСАнгл = ", including VAT 0,00 " + Валюта;
		КонецЕсли;				
	КонецЕсли;	
	
	мПеревыставление 			= Ссылка.Услуги.НайтиСтроки(Новый Структура("ПорядокОтражения", ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление")));
	мПеревыставлениеПоСтавкам 	= Ссылка.Услуги.НайтиСтроки(Новый Структура("ПорядокОтражения", ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам")));

	мПеревыставлениеКоличество 				= мПеревыставление.Количество();
	ммПеревыставлениеПоСтавкамКоличество 	= мПеревыставлениеПоСтавкам.Количество();
	
	мВсегоПеревыставление = мПеревыставлениеКоличество + ммПеревыставлениеПоСтавкамКоличество;
	
	тДополнение = "";
	тДополнениеАнгл = "";
	Если мВсегоПеревыставление = Ссылка.Услуги.Количество() Тогда
		//все строки перевыставление
		тДополнение = "возмещаемых ";
		тДополнениеАнгл = "reimbursable ";
	КонецЕсли;
	
	ИтогоРазницаПоАкту = ТаблицаУслуг.Итог("Всего") - ТаблицаУслуг.Итог("Всего_ДоКорректировки");
	
	Если ПараметрыДоговора.ЯзыкПечатиДокументов=1 Тогда 
		тСуммаПрописьюАнгл 	= CW_Печать.СформироватьСуммуПрописьюАнгл(Макс(ИтогоРазницаПоАкту,-ИтогоРазницаПоАкту), Валюта);
		СуммаПрописьюАнгл 	= ?(ИтогоРазницаПоАкту<0,"Minus "+ НРег(тСуммаПрописьюАнгл),тСуммаПрописьюАнгл);
		
		обл.Параметры.ИтоговыйТекст = "Total "+тДополнениеАнгл+?(ПараметрыДоговора.Услуги0Или1Работы=0, "services rendered", "work performed")+" to the amount "+Формат(ИтогоРазницаПоАкту,"ЧДЦ=2; ЧРД=.; ЧРГ=,")+" "+ Валюта+" ("+СуммаПрописьюАнгл+")" + ПредставлНДСАнгл  
		+". The above "+?(ПараметрыДоговора.Услуги0Или1Работы=0, "services are rendered", "work is performed")+" in full and on term. The customer has no claims with regarding the range, quality and term of "+?(ПараметрыДоговора.Услуги0Или1Работы=0, "rendered service", "performed work")+".";
		
	ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов=2 Тогда 
		тСуммаПрописью 		= ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(Макс(ИтогоРазницаПоАкту,-ИтогоРазницаПоАкту), Валюта);
		тСуммаПрописьюАнгл 	= CW_Печать.СформироватьСуммуПрописьюАнгл(Макс(ИтогоРазницаПоАкту,-ИтогоРазницаПоАкту), Валюта);
	
		СуммаПрописью 		= ?(ИтогоРазницаПоАкту<0,"Минус "+НРег(тСуммаПрописью),		тСуммаПрописью); // ВызовБП
		СуммаПрописьюАнгл	= ?(ИтогоРазницаПоАкту<0,"Minus "+НРег(тСуммаПрописьюАнгл),	тСуммаПрописьюАнгл);
		
		обл.Параметры.ИтоговыйТекст = "Общая стоимость "+тДополнение+?(ПараметрыДоговора.Услуги0Или1Работы=0, "услуг", "работ")+" составляет "+Формат(ИтогоРазницаПоАкту, "ЧДЦ=2") + " " + Валюта
		+" ("+СуммаПрописью+")" + ПредставлНДС
		+" "+?(ПараметрыДоговора.Услуги0Или1Работы=0, "Услуги оказаны", "Работы выполнены")+" полностью. Стороны претензий по объему, качеству и срокам "+?(ПараметрыДоговора.Услуги0Или1Работы=0, "оказания услуг", "выполнения работ")+" друг к другу не имеют."
		+Символы.ПС
		+Символы.ПС
		+"Total "+тДополнениеАнгл+?(ПараметрыДоговора.Услуги0Или1Работы=0, "services rendered", "work performed")+" to the amount "+Формат(ИтогоРазницаПоАкту,"ЧДЦ=2; ЧРД=.; ЧРГ=,")+" "+ Валюта+" ("+СуммаПрописьюАнгл+")" + ПредставлНДСАнгл
		+". The above "+?(ПараметрыДоговора.Услуги0Или1Работы=0, "services are rendered", "work is performed")+" in full and on term. The customer has no claims with regarding the range, quality and term of "+?(ПараметрыДоговора.Услуги0Или1Работы=0, "rendered service", "performed work")+"."
		;
	Иначе 
		тСуммаПрописью 		= ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(Макс(ИтогоРазницаПоАкту,-ИтогоРазницаПоАкту), Валюта);
		СуммаПрописью 		= ?(ИтогоРазницаПоАкту<0,"Минус "+НРег(тСуммаПрописью),		тСуммаПрописью); // ВызовБП
		
		// ВызовБП
		обл.Параметры.ИтоговыйТекст = "Общая стоимость "+тДополнение+?(ПараметрыДоговора.Услуги0Или1Работы=0, "услуг", "работ")+" составляет "+Формат(ИтогоРазницаПоАкту, "ЧДЦ=2") + " " + Валюта  
		+" ("+СуммаПрописью+")" + ПредставлНДС 
		+" "+?(ПараметрыДоговора.Услуги0Или1Работы=0, "Услуги оказаны", "Работы выполнены")+" полностью. Стороны претензий по объему, качеству и срокам "+?(ПараметрыДоговора.Услуги0Или1Работы=0, "оказания услуг", "выполнения работ")+" друг к другу не имеют."
		;
	КонецЕсли;
	Подвал.Вывести(обл);
	
	//----------------------
	// дополнительно
	Если ПараметрыДоговора.ВыводитьДополнениеВПодавлеАкта Тогда
		
		Если ВывестиНаРрусском Тогда
			обл = Макет.ПолучитьОбласть("Дополнительно_Рус");
			обл.Параметры.Дополнительно = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеПодвалаАктаРус, Ссылка, Неопределено, Ссылка.Услуги);
			Подвал.Вывести(обл);
		КонецЕсли;
		Если ВывестиНаАнглийском Тогда
			обл = Макет.ПолучитьОбласть("Дополнительно_Англ");
			обл.Параметры.Дополнительно_Англ = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеПодвалаАктаАнгл, Ссылка, Неопределено, Ссылка.Услуги);
			Подвал.Вывести(обл);
		КонецЕсли;
	КонецЕсли;			
	

	// подписи, печать
	Подписанты = CW_Печать.ВернутьПодписантов(Ссылка, ПараметрыДоговора); 
	
	ВыводитьПодписиИПечать 	= ПодписьИПечать или (Ссылка.Договор.ПодписьИПечатьАкты И ДляРассылки) ;
	
	обл = Макет.ПолучитьОбласть("Подписи");  
	
	Если ВыводитьПодписиИПечать Тогда
		ПечатьОрганизации   = CW_Печать.ПолучитьПечатьОрганизации(Ссылка.Организация, НастройкиПечати.ПодключаемыйОбъект, Ссылка.ДатаАкта, Ложь);
		ПодписьРуководителя = CW_Печать.ПолучитьПодписьСотрудника(Подписанты.Руководитель, Ложь);
	КонецЕсли;
	
	обл.Рисунки.ПечатьОрганизации.Линия 			= Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	обл.Рисунки.ПечатьОрганизации.ВыводитьНаПечать 	= Ложь;
	Если ВыводитьПодписиИПечать и ПечатьОрганизации <> Неопределено Тогда
		обл.Рисунки.ПечатьОрганизации.ВыводитьНаПечать 	= Истина;
		обл.Рисунки.ПечатьОрганизации.Картинка 			= Новый Картинка(ПечатьОрганизации);
	КонецЕсли;	
	
	обл.Рисунки.ПодписьРуководителя.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	обл.Рисунки.ПодписьРуководителя.ВыводитьНаПечать 	= Ложь;
	Если ВыводитьПодписиИПечать и ПодписьРуководителя <> Неопределено Тогда
		обл.Рисунки.ПодписьРуководителя.ВыводитьНаПечать 	= Истина;
		обл.Рисунки.ПодписьРуководителя.Картинка 			= Новый Картинка(ПодписьРуководителя);
	КонецЕсли;	
	
	//---подписи, печать
	
	Если ПараметрыДоговора.ЯзыкПечатиДокументов=1 Тогда 
		обл.Параметры.НадписьРаботуСдал = "Contractor";
		обл.Параметры.НадписьРаботуПринял = "Customer";
		обл.Параметры.ДолжностьИсполнителя = Подписанты.РуководительДолжностьАнг;
		обл.Параметры.ФИОИсполнителя = CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(РегистрыСведений.CW_ПараметрыСотрудников.ПолучитьФамилиюИмяАнгл(Подписанты.Руководитель))
		+ ?(ЗначениеЗаполнено(Подписанты.РуководительОснованиеАнг), " (" + Подписанты.РуководительОснованиеАнг + ")", "");
		обл.Параметры.ДолжностьЗаказчика = ПараметрыДоговора.ДолжностьРуководителяАнгл;
		обл.Параметры.ФИОЗаказчика = CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.РуководительАнгл) 
		+ ?(ЗначениеЗаполнено(ПараметрыДоговора.РуководительКонтрагентаОснованиеАнгл), " (" + ПараметрыДоговора.РуководительКонтрагентаОснованиеАнгл + ")", "");
		обл.Параметры.НадписьМП = "SEAL";
	ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов=2 Тогда 
		обл.Параметры.НадписьРаботуСдал = "Исполнитель / Contractor";
		обл.Параметры.НадписьРаботуПринял = "Заказчик / Customer";
		обл.Параметры.ДолжностьИсполнителя = Подписанты.РуководительДолжностьРус + Символы.ПС + Подписанты.РуководительДолжностьАнг;
		обл.Параметры.ФИОИсполнителя = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.Руководитель,Ссылка.Дата) + ?(ЗначениеЗаполнено(Подписанты.РуководительОснованиеРус), " (" + Подписанты.РуководительОснованиеРус + ")", "")
		+Символы.ПС+ CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(РегистрыСведений.CW_ПараметрыСотрудников.ПолучитьФамилиюИмяАнгл(Подписанты.Руководитель)) 
		+?(ЗначениеЗаполнено(Подписанты.РуководительОснованиеАнг), " (" + Подписанты.РуководительОснованиеАнг + ")", "");
		обл.Параметры.ДолжностьЗаказчика = ПараметрыДоговора.ДолжностьРуководителя+Символы.ПС+ПараметрыДоговора.ДолжностьРуководителяАнгл;
		обл.Параметры.ФИОЗаказчика = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.Руководитель,Ссылка.Дата) + ?(ЗначениеЗаполнено(ПараметрыДоговора.РуководительКонтрагентаОснование), " (" + ПараметрыДоговора.РуководительКонтрагентаОснование + ")", "") 
		+Символы.ПС+ CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.РуководительАнгл) + ?(ЗначениеЗаполнено(ПараметрыДоговора.РуководительКонтрагентаОснованиеАнгл), " (" + ПараметрыДоговора.РуководительКонтрагентаОснованиеАнгл + ")", "");;  
		обл.Параметры.НадписьМП = "М.П."+Символы.ПС+"SEAL";
	Иначе 
		обл.Параметры.НадписьРаботуСдал = "Исполнитель";
		обл.Параметры.НадписьРаботуПринял = "Заказчик";    
		обл.Параметры.ДолжностьИсполнителя = Подписанты.РуководительДолжностьРус; 
		обл.Параметры.ФИОИсполнителя = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.Руководитель,Ссылка.Дата) + ?(ЗначениеЗаполнено(Подписанты.РуководительОснованиеРус), " (" + Подписанты.РуководительОснованиеРус + ")", "");
		обл.Параметры.ДолжностьЗаказчика = ПараметрыДоговора.ДолжностьРуководителя;
		обл.Параметры.ФИОЗаказчика = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.Руководитель,Ссылка.Дата) + ?(ЗначениеЗаполнено(ПараметрыДоговора.РуководительКонтрагентаОснование), " (" + ПараметрыДоговора.РуководительКонтрагентаОснование + ")", ""); 
		обл.Параметры.НадписьМП = "М.П.";
	КонецЕсли;
	Подвал.Вывести(обл);
	
	// подготовка единиц измерения
	ТЗЕИ = ТаблицаУслуг.Скопировать(,"Номенклатура");
	ТЗЕИ.Свернуть("Номенклатура");
	МассивНоменклатуры = ТЗЕИ.ВыгрузитьКолонку("Номенклатура");
	// --- 
	МассивЯзыков = Новый Массив;
	МассивЯзыков.Добавить(Справочники.CW_Языки.ru);
	МассивЯзыков.Добавить(Справочники.CW_Языки.en);
	// --- 
	ОсновнойЯзык = Константы.CW_ОсновнойЯзык.Получить();
	// --- 
	СоответствиеПереводовЕдиниц = Новый Соответствие;
	// --- 
	Для каждого Номенклатура Из МассивНоменклатуры Цикл
		СтруктураПеревода = CW_ПереводыСервер.ПолучитьПереводы(Номенклатура.ЕдиницаИзмерения, , МассивЯзыков);
		СоответствиеПереводовЕдиниц.Вставить(Номенклатура.ЕдиницаИзмерения, СтруктураПеревода);
	КонецЦикла;
	
	НомСтрГП = 0;
	Для каждого усл Из ТаблицаУслуг Цикл
		
		Если  (Усл.Количество = Усл.Количество_ДоКорректировки) И (Усл.Сумма 	= усл.Сумма_ДоКорректировки) 
			И (Усл.НДС    = усл.НДС_ДоКорректировки) И (Усл.Всего = усл.Всего_ДоКорректировки) Тогда
			Продолжить;
		КонецЕсли;
	
		_сф.Инкремент(ТекущаяСтрока);
		
		Если ПараметрыДоговора.ЯзыкПечатиДокументов=1 Тогда 
			облСтрокаТаблицы.Параметры.ТекстА = "A (before the change)";
			облСтрокаТаблицы.Параметры.ТекстБ = "B (after the change)";
			облСтрокаТаблицы.Параметры.ТекстВ = "C (increase)";
			облСтрокаТаблицы.Параметры.ТекстГ = "D (decrease)";
		ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов=2 Тогда 
			
			облСтрокаТаблицы.Параметры.ТекстА = "А (до изменения) /"+Символы.ПС+"A (before the change)";
			облСтрокаТаблицы.Параметры.ТекстБ = "Б (после изменения) /"+Символы.ПС+" B (after the change)";
			облСтрокаТаблицы.Параметры.ТекстВ = "В (увеличение) /"+Символы.ПС+" C (increase)";
			облСтрокаТаблицы.Параметры.ТекстГ = "Г (уменьшение) /"+Символы.ПС+" D (decrease)";
			
		Иначе 
			облСтрокаТаблицы.Параметры.ТекстА = "А (до изменения)";
			облСтрокаТаблицы.Параметры.ТекстБ = "Б (после изменения)";
			облСтрокаТаблицы.Параметры.ТекстВ = "В (увеличение)";
			облСтрокаТаблицы.Параметры.ТекстГ = "Г (уменьшение)";
		КонецЕсли;
		
		
		облСтрокаТаблицы.Параметры.Номер = ТекущаяСтрока;
		облСтрокаТаблицы.Параметры.Наименование = усл.Представление;
		// --- 
		ПД = ПараметрыДоговора;
		
		Если СокрЛП(усл.Номенклатура.ЕдиницаИзмерения.Наименование) = "-" Тогда
			
			облСтрокаТаблицы.Параметры.ЕдиницаДо 	= "-";
			облСтрокаТаблицы.Параметры.КоличествоДо = "-";
			облСтрокаТаблицы.Параметры.ЦенаДо 		= "-";
			
			облСтрокаТаблицы.Параметры.ЕдиницаПосле 	= "-";
			облСтрокаТаблицы.Параметры.КоличествоПосле 	= "-";
			облСтрокаТаблицы.Параметры.ЦенаПосле 		= "-";
			
		Иначе	
			Если (ПД.ЯзыкПечатиДокументов=0) Тогда
				ЕИ = СоответствиеПереводовЕдиниц.Получить(усл.Номенклатура.ЕдиницаИзмерения)["ru"];
			ИначеЕсли (ПД.ЯзыкПечатиДокументов=1) Тогда 
				ЕИ = СоответствиеПереводовЕдиниц.Получить(усл.Номенклатура.ЕдиницаИзмерения)["en"]; 
			ИначеЕсли (ПД.ЯзыкПечатиДокументов=2) Тогда 
				ЕИ = СоответствиеПереводовЕдиниц.Получить(усл.Номенклатура.ЕдиницаИзмерения)["ru"] + "/" + СоответствиеПереводовЕдиниц.Получить(усл.Номенклатура.ЕдиницаИзмерения)["en"];
			КонецЕсли; 
			облСтрокаТаблицы.Параметры.ЕдиницаДо 	= ЕИ;
			облСтрокаТаблицы.Параметры.ЕдиницаПосле = ЕИ;
			
			облСтрокаТаблицы.Параметры.КоличествоДо 	= Усл.Количество_ДоКорректировки;
			облСтрокаТаблицы.Параметры.КоличествоПосле 	= Усл.Количество;
			
			ЦенаДо =  Окр(?(усл.Количество_ДоКорректировки = 0,0,усл.Сумма_ДоКорректировки/усл.Количество_ДоКорректировки),2,1);
			облСтрокаТаблицы.Параметры.ЦенаДо = ЦенаДо;
			
			ЦенаПосле = Окр(?(усл.Количество=0, 0, усл.Сумма/усл.Количество),2,1);
			облСтрокаТаблицы.Параметры.ЦенаПосле = ЦенаПосле;
		КонецЕсли;	
		                               												
		облСтрокаТаблицы.Параметры.СуммаДо     	= усл.Сумма_ДоКорректировки;
		облСтрокаТаблицы.Параметры.СуммаПосле	= усл.Сумма;
		
		облСтрокаТаблицы.Параметры.СуммаУвеличение 	= усл.СуммаУвеличение;
		облСтрокаТаблицы.Параметры.СуммаУменьшение	= усл.СуммаУменьшение;
		
		
		// подготовим представление ставки "БезНДС"			
		Если (ПД.ЯзыкПечатиДокументов = 0) Тогда
			ПредставлениеБезНДС = "БЕЗ НДС";
		ИначеЕсли (ПД.ЯзыкПечатиДокументов = 1) Тогда 
			ПредставлениеБезНДС = "Without VAT"; 
		ИначеЕсли (ПД.ЯзыкПечатиДокументов = 2) Тогда 
			ПредставлениеБезНДС = "БЕЗ НДС / Without VAT";
		КонецЕсли; 
		облСтрокаТаблицы.Параметры.СтавкаНДСДо 		= ?(усл.СтавкаНДС_ДоКорректировки = Перечисления.СтавкиНДС.БезНДС, ПредставлениеБезНДС, усл.СтавкаНДС_ДоКорректировки);
		облСтрокаТаблицы.Параметры.СтавкаНДСПосле 	= ?(усл.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС, ПредставлениеБезНДС, усл.СтавкаНДС);
		
		облСтрокаТаблицы.Параметры.СуммаНДСДо  		= ?(усл.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС, "-",  усл.НДС_ДоКорректировки);
		облСтрокаТаблицы.Параметры.СуммаНДСПосле  	= ?(усл.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС, "-",  усл.НДС);
		
		облСтрокаТаблицы.Параметры.СуммаНДСУвеличение 	= усл.СуммаНДСУвеличение;
		облСтрокаТаблицы.Параметры.СуммаНДСУменьшение	= усл.СуммаНДСУменьшение;
		
		облСтрокаТаблицы.Параметры.ИтогоДо     =  усл.Всего_ДоКорректировки;
		облСтрокаТаблицы.Параметры.ИтогоПосле  =  усл.Всего;
		
		облСтрокаТаблицы.Параметры.ИтогоУвеличение 	= усл.ИтогоУвеличение;
		облСтрокаТаблицы.Параметры.ИтогоУменьшение	= усл.ИтогоУменьшение;
		
		ТД.Вывести(облСтрокаТаблицы);
		
		// ---------------------------------------------------------------------------- 
		
	КонецЦикла;
	
	ТД.Вывести(Подвал);

	//исполнитель документа
	Если Не Ссылка.Ответственный.Пустая() и ПараметрыДоговора.ВыводитьИсполнителяАкт Тогда
		
		ОбластьРазделитель = Макет.ПолучитьОбласть("Разделитель");
		ТД.Вывести(ОбластьРазделитель);
		
		ТелефонИсполнителя 			= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ссылка.Ответственный, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонПользователя"),,Истина);		
		ИсполнительФизическоеЛицо 	= Ссылка.Ответственный.ФизическоеЛицо;
		
		Если ВывестиНаРрусском Тогда
			Если ИсполнительФизическоеЛицо.Пустая() Тогда
				Исполнитель_рус = "";
			Иначе
				Исполнитель_рус = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ИсполнительФизическоеЛицо);
			КонецЕсли;
			
			ОбластьИсполнитель_Рус = Макет.ПолучитьОбласть("Исполнитель_Рус");
			ОбластьИсполнитель_Рус.Параметры.Исполнитель 		= "Исп."+ Исполнитель_рус;
			ОбластьИсполнитель_Рус.Параметры.ТелефонИсполнителя = "Тел."+ ТелефонИсполнителя;
			
			ТД.Вывести(ОбластьИсполнитель_Рус);
		КонецЕсли;
		
		Если ВывестиНаАнглийском Тогда
			Если ИсполнительФизическоеЛицо.Пустая() Тогда
				ИсполнительАнгл = "";
			Иначе
				ИсполнительАнгл =  CW_ПереводыСервер.ПолучитьПеревод(ИсполнительФизическоеЛицо,, Справочники.CW_Языки.en);
				
				ЧастиИмени 			= ФизическиеЛицаКлиентСервер.ЧастиИмени(ИсполнительАнгл);
				Исполнитель_Англ	= ЧастиИмени.Фамилия  + " " + ЧастиИмени.Имя;
			КонецЕсли;
			
			ОбластьИсполнитель_Англ = Макет.ПолучитьОбласть("Исполнитель_Англ");
			ОбластьИсполнитель_Англ.Параметры.Исполнитель_Англ 		  = "Exe." + Исполнитель_Англ;
			ОбластьИсполнитель_Англ.Параметры.ТелефонИсполнителя_Англ = "Tel." + ТелефонИсполнителя;	
			
			ТД.Вывести(ОбластьИсполнитель_Англ);
		КонецЕсли;
		
		
	КонецЕсли;
	//исполнитель документа
	
	
	//Исключение
	//	
	//	Сообщить(ОписаниеОшибки());
	//	
	//КонецПопытки; 
	
	
	СтруктураПФ.ПечатнаяФорма = ТД;
	
	// ---------------------------------------------------------------------------- 
	
	Возврат СтруктураПФ;
	
КонецФункции // Печать

Функция СписокСвязанныхСчетов(Язык)
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				СсылкаНаОбъект.Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		СсылкаНаОбъект.ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, СсылкаНаОбъект.Дата);

	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	CW_СоответствиеАктовИсходящимСчетам.Счет 
	|ИЗ
	|	РегистрСведений.CW_СоответствиеАктовИсходящимСчетам КАК CW_СоответствиеАктовИсходящимСчетам
	|ГДЕ
	|	CW_СоответствиеАктовИсходящимСчетам.Акт = &Акт";
	Запрос.УстановитьПараметр("Акт", СсылкаНаОбъект);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Ответ = ""; ОтветАнгл = "";
	Для Каждого Стр из ТЗ Цикл
		Если (ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет) Тогда
			НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Стр.Счет.ВедомыйСчет);
			ДатаДокумента = Стр.Счет.ВедомыйСчет.Дата;
		Иначе
			НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Стр.Счет, "НомерСчета", "ДатаСчета");
			ДатаДокумента = Стр.Счет.ДатаСчета;
		КонецЕсли; 
		Ответ     = Ответ     + "№" + НомерДокумента + " от " + Формат(ДатаДокумента, "ДФ=dd.MM.yyyy") + "; ";
		ОтветАнгл = ОтветАнгл + "№" + НомерДокумента + " of " + Формат(ДатаДокумента, "ДФ=dd.MM.yyyy") + "; ";
	КонецЦикла;	
	
	Если НЕ ЗначениеЗаполнено(Ответ) Тогда
		Возврат "";
	Иначе
		Ответ =     Сред(Ответ,     1, СтрДлина(Ответ)     - 2);
		ОтветАнгл = Сред(ОтветАнгл, 1, СтрДлина(ОтветАнгл) - 2);
		Если Язык = 0 Тогда
			Возврат "к счету " + Ответ;
		ИначеЕсли Язык = 1 Тогда
			Возврат "to invoice " + ОтветАнгл;
		Иначе
			Возврат "к счету " + Ответ + Символы.ПС + "to invoice " + ОтветАнгл;
		КонецЕсли;	
	КонецЕсли;	
	
КонецФункции	
#КонецЕсли
